Revit 2024 API
AnalysisDisplayLegendSettings.ScaleHeight Property
 Height of scale (for Diagram display). Measured in paperspace units.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public int ScaleHeight { get; set; }
Visual Basic
Public Property ScaleHeight As Integer
	Get
	Set
Visual C++
public:
property int ScaleHeight {
	int get ();
	void set (int value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentsInconsistentException |  When setting this property: scaleHeight is greater than 10000 or less than 0
See Also
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace